Revit 2015 API
View Properties
The View type exposes the following members.
Properties
Name | Description
AnalysisDisplayStyleId
 Element id of Analysis Display Style associated with the view.
AreAnalyticalModelCategoriesHidden
 Indicates if analytical model categories are currently hidden in the view.
AreAnnotationCategoriesHidden
 Indicates if annotation categories are currently hidden in the view.
AreImportCategoriesHidden
 Indicates if import categories are currently hidden in the view.
AreModelCategoriesHidden
 Indicates if model categories are currently hidden in the view.
ArePointCloudsHidden
 Indicates if point clouds are currently hidden in the view.
AssemblyInstanceId
 The id of the assembly instance to which the element belongs.
 (Inherited from Element.)
AssociatedAssemblyInstanceId
 The Id of the assembly instance that owns the assembly view.
BoundingBox
Retrieves a box that circumscribes all geometry of the element.
 (Inherited from Element.)
CanBePrinted
Test whether the view can be printed.
Category
Retrieves a Category object that represents the category or sub category in which the element resides.
 (Inherited from Element.)
CreatedPhaseId
 Id of a Phase at which the Element was created.
 (Inherited from Element.)
CropBox
The Crop Box applied to the view, or an outline encompassing the crop region applied to the view.
CropBoxActive
Whether or not the Crop Box/Region is active for the view.
CropBoxVisible
Whether or not the Crop Box/Region is visible for the view.
DemolishedPhaseId
 Id of a Phase at which the Element was demolished.
 (Inherited from Element.)
DesignOption
Returns the design option to which the element belongs.
 (Inherited from Element.)
DetailLevel
 The detail level of this view.
Discipline
 The Discipline of the view.
DisplayStyle
 The DisplayStyle of the view. Returns DisplayStyle.Wireframe if the view has no display style.
Document
Returns the Document in which the Element resides.
 (Inherited from Element.)
GenLevel
The level for the view.
Geometry
Retrieves the geometric representation of the element.
 (Inherited from Element.)
GroupId
 The id of the group to which an element belongs.
 (Inherited from Element.)
Id
 A unique identifier for an Element in an Autodesk Revit project.
 (Inherited from Element.)
IsAssemblyView
 Indicates if the view is assembly view.
IsTemplate
Test whether the view is a view template.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
 (Inherited from Element.)
LevelId
 The id of the level associated with the element.
 (Inherited from Element.)
Location
This property is used to find the physical location of an element within a project.
 (Inherited from Element.)
Name
A human readable name for the Element.
 (Inherited from Element.)
Origin
Returns the origin of the screen.
Outline
The bounds of the view in paper space (in inches).
OwnerViewId
 The id of the view that owns the element.
 (Inherited from Element.)
Parameter[Guid]
Retrieves a parameter from the element given a GUID for a shared parameter.
 (Inherited from Element.)
Parameter[String]
Retrieves a parameter from the element given its name.
 (Inherited from Element.)
Parameter[BuiltInParameter]
Retrieves a parameter from the element given a parameter id.
 (Inherited from Element.)
Parameter[Definition]
Retrieves a parameter from the element based on its definition.
 (Inherited from Element.)
Parameters
Retrieves a set containing all of the parameters that are contained within the element.
 (Inherited from Element.)
ParametersMap
Retrieves a map containing all of the parameters that are contained within the element.
 (Inherited from Element.)
PartsVisibility
 The visibility setting for parts in this view.
Pinned
 Identifies if the element has been pinned to prevent changes.
 (Inherited from Element.)
RightDirection
The direction towards the right side of the screen.
Scale
The scale of the view.
ShadowIntensity
 The intesity of cast shadows - 0 = no shadows, 100 = black.
ShowEdges |  Obsolete.
 Indicates whether the edges are visible or not.
ShowSilhouettes |  Obsolete.
 Indicates whether analytical surface silhouettes are calculated and shown.
SilhouetteLineStyleId |  Obsolete.
 Id of line style in used to draw silhouettes.
SketchPlane
The sketch plane assigned to the view for model curve creation.
SunAndShadowSettings
The sun and shadow settings assigned to the view for shadow calculation and rendering.
SunlightIntensity
 The intensity of the simulated (directional) sunlight. 0 = no directional light; maximum value is 100.
SurfaceTransparency |  Obsolete.
 The amount of transparency applied to all surfaces. 0 = opaque, 100 = fully transparent.
Title
 The view title. This consists of the view name plus other modifiers, such as the view type, sheet number, area scheme, and/or assembly type, depending on the specifics of the view.
UniqueId
 A stable unique identifier for an element within the document.
 (Inherited from Element.)
UpDirection
The direction towards the top of the screen.
ViewDirection
The direction towards the viewer.
ViewName
The name of the view.
ViewSpecific
 Identifies if the element is owned by a view.
 (Inherited from Element.)
ViewTemplateId
 Id of template that controls view parameters.
ViewType
The type of the view.
WorksetId
 Get Id of the Workset which owns the element.
 (Inherited from Element.)
See Also
View Class
Autodesk.Revit.DB Namespace